## Tuplas

Coleccion de objetos que es inmutable (no se pueden cambiar)

In [108]:
#
tupla_alumno = ('Juan', 'Díaz', 22)

In [109]:
type(tupla_alumno)

tuple

In [110]:
tupla_alumno.remove('Juan')

AttributeError: 'tuple' object has no attribute 'remove'

## Diccionarios

clave-valor

In [111]:
d_alumno1= {'Nombre': 'Jimena', 'Apellido': 'Rosa'}

In [112]:
type(d_alumno1)

dict

In [113]:
grupo_metodosE= {'Nombre':['Ale', 'Ana', 'Alba'], 'Edad': {24, 19, 32}}

In [114]:
grupo_metodosE.keys()

dict_keys(['Nombre', 'Edad'])

In [115]:
grupo_metodosE['Edad']

{19, 24, 32}

In [116]:
grupo_metodosE.values()

dict_values([['Ale', 'Ana', 'Alba'], {24, 32, 19}])

## Pandas
Pandas está construido sobre numpy, por tanto todas las funciones de numpy se pueden usar en pandas.

Pandas sirve para manejar datos estructurados, los cuales son de tres tipos:
1. Series (unidimensionales)
2. Dataframes (filas-columnas)
3. Panel (filas y columnas, a traves del tiempo)

Supongamos que conocemos las edades de: Juan 23, Jorge 18, Raúl 15, Omar 31

In [122]:
import panda as pd

ModuleNotFoundError: No module named 'panda'

In [125]:
edades=[23,18,15,31]

In [126]:
edades

[23, 18, 15, 31]

In [127]:
edades= pd.Series(edades, index=['Juan', 'Jorge', 'Raúl', 'Omar'])

In [128]:
edades

Juan     23
Jorge    18
Raúl     15
Omar     31
dtype: int64

## Dataframes

datos organizados en filas y columnas

In [129]:
alumno1 = ['Jorge', 'Perez', 21]
alumno2 = ['Ana', 'Rosas', 26]
alumno3 = ['Raúl', 'Gómez', 22]
alumno4 = ['Andrea', 'Solis', 19]

In [130]:
clase_estadistica=[alumno1, alumno2, alumno3, alumno4]

In [131]:
clase_estadistica

[['Jorge', 'Perez', 21],
 ['Ana', 'Rosas', 26],
 ['Raúl', 'Gómez', 22],
 ['Andrea', 'Solis', 19]]

In [132]:
#convertirlo en dataframe
clase_estadistica= pd.DataFrame(clase_estadistica, columns=['Nombre', 'Apellido', 'Edad'])

In [133]:
clase_estadistica

   Nombre Apellido  Edad
0   Jorge    Perez    21
1     Ana    Rosas    26
2    Raúl    Gómez    22
3  Andrea    Solis    19

In [134]:
clase_estadistica.index

RangeIndex(start=0, stop=4, step=1)

In [135]:
clase_estadistica.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [136]:
clase_estadistica.shape

(4, 3)

In [137]:
clase_estadistica

   Nombre Apellido  Edad
0   Jorge    Perez    21
1     Ana    Rosas    26
2    Raúl    Gómez    22
3  Andrea    Solis    19

In [138]:
clase_estadistica['Municipio']=  ['Mty', 'Apodaca', 'Escobedo', 'Santiago']

In [139]:
clase_estadistica['Edad_dias']= clase_estadistica['Edad']*365

In [140]:
clase_estadistica

   Nombre Apellido  Edad Municipio  Edad_dias
0   Jorge    Perez    21       Mty       7665
1     Ana    Rosas    26   Apodaca       9490
2    Raúl    Gómez    22  Escobedo       8030
3  Andrea    Solis    19  Santiago       6935

# Seleccionar elementos de un dataframe
1. Selección estándar
2. Selección .iloc
3. Selección .loc
4. Selección condicional

In [141]:
## selección estándar
#columnas
clase_estadistica['Edad']

0    21
1    26
2    22
3    19
Name: Edad, dtype: int64

In [142]:
clase_estadistica[['Edad', 'Nombre']]

   Edad  Nombre
0    21   Jorge
1    26     Ana
2    22    Raúl
3    19  Andrea

In [143]:
#selección estándar
#rango filA
clase_estadistica[0:2]

  Nombre Apellido  Edad Municipio  Edad_dias
0  Jorge    Perez    21       Mty       7665
1    Ana    Rosas    26   Apodaca       9490

In [144]:
clase_estadistica['Nombre'][2:4]

2      Raúl
3    Andrea
Name: Nombre, dtype: object

## selección .iloc (posición)
Dataframe.iloc[posición filas, posición columnas]

In [145]:
clase_estadistica.iloc[:,:]

   Nombre Apellido  Edad Municipio  Edad_dias
0   Jorge    Perez    21       Mty       7665
1     Ana    Rosas    26   Apodaca       9490
2    Raúl    Gómez    22  Escobedo       8030
3  Andrea    Solis    19  Santiago       6935

In [146]:
clase_estadistica.iloc[:,3]

0         Mty
1     Apodaca
2    Escobedo
3    Santiago
Name: Municipio, dtype: object

In [148]:
clase_estadistica.iloc[0]

Nombre       Jorge
Apellido     Perez
Edad            21
Municipio      Mty
Edad_dias     7665
Name: 0, dtype: object

In [149]:
clase_estadistica.iloc[2:4,[0,2]]

   Nombre  Edad
2    Raúl    22
3  Andrea    19

##seleccion .loc etiquetas

Dataframe.loc[nombre filas, nombre columnas]

In [150]:
clase_estadistica = clase_estadistica.set_index("Municipio")

In [151]:
clase_estadistica

           Nombre Apellido  Edad  Edad_dias
Municipio
Mty         Jorge    Perez    21       7665
Apodaca       Ana    Rosas    26       9490
Escobedo     Raúl    Gómez    22       8030
Santiago   Andrea    Solis    19       6935

In [153]:
clase_estadistica.loc[['Apodaca', 'Mty']]

          Nombre Apellido  Edad  Edad_dias
Municipio
Apodaca      Ana    Rosas    26       9490
Mty        Jorge    Perez    21       7665

In [154]:
clase_estadistica.Apellido

Municipio
Mty         Perez
Apodaca     Rosas
Escobedo    Gómez
Santiago    Solis
Name: Apellido, dtype: object

## Selección condicional
Dataframe[condicion]

In [155]:
clase_estadistica[clase_estadistica['Edad']>=20]

          Nombre Apellido  Edad  Edad_dias
Municipio
Mty        Jorge    Perez    21       7665
Apodaca      Ana    Rosas    26       9490
Escobedo    Raúl    Gómez    22       8030

In [156]:
#alernativa
clase_estadistica.query('Edad>=20')

          Nombre Apellido  Edad  Edad_dias
Municipio
Mty        Jorge    Perez    21       7665
Apodaca      Ana    Rosas    26       9490
Escobedo    Raúl    Gómez    22       8030

In [162]:
#alernativa
clase_estadistica.query('Edad>=20 & Apellido == "Perez"')

          Nombre Apellido  Edad  Edad_dias
Municipio
Mty        Jorge    Perez    21       7665

In [163]:
clase_estadistica

           Nombre Apellido  Edad  Edad_dias
Municipio
Mty         Jorge    Perez    21       7665
Apodaca       Ana    Rosas    26       9490
Escobedo     Raúl    Gómez    22       8030
Santiago   Andrea    Solis    19       6935

In [165]:
#ordenar menor a mayor
clase_estadistica.sort_values('Edad')

           Nombre Apellido  Edad  Edad_dias
Municipio
Santiago   Andrea    Solis    19       6935
Mty         Jorge    Perez    21       7665
Escobedo     Raúl    Gómez    22       8030
Apodaca       Ana    Rosas    26       9490

In [169]:
#ordenar mayor a menor
clase_estadistica.sort_values('Edad', ascending=False)

           Nombre Apellido  Edad  Edad_dias
Municipio
Apodaca       Ana    Rosas    26       9490
Escobedo     Raúl    Gómez    22       8030
Mty         Jorge    Perez    21       7665
Santiago   Andrea    Solis    19       6935

In [170]:
clase_estadistica.sort_values('Apellido')

           Nombre Apellido  Edad  Edad_dias
Municipio
Escobedo     Raúl    Gómez    22       8030
Mty         Jorge    Perez    21       7665
Apodaca       Ana    Rosas    26       9490
Santiago   Andrea    Solis    19       6935

## Podemos usar las funciones de numpy

In [171]:
clase_estadistica['Edad'].sum()

88

In [172]:
clase_estadistica['Edad'].var().round(1)

8.7

## np.where(condición, valor si cumplo, valor si no se cumple)

In [176]:
import numpy as np

In [179]:
# clasificar mayor y menor de edad
clase_estadistica['mayoria_edad']= np.where(clase_estadistica['Edad']>=18, 'mayor', 'menor')

In [180]:
clase_estadistica

           Nombre Apellido  Edad  Edad_dias mayoria_edad
Municipio
Mty         Jorge    Perez    21       7665        mayor
Apodaca       Ana    Rosas    26       9490        mayor
Escobedo     Raúl    Gómez    22       8030        mayor
Santiago   Andrea    Solis    19       6935        mayor

## np.select(condiciones, valor condición, valor si no cumple ninguna condición)

In [182]:
##
condiciones = [clase_estadistica['Edad']<=17,
                clase_estadistica['Edad']<=23,
                clase_estadistica['Edad']>=23]
valores = ['Prepa', 'Universidad', 'Trabajando']
clase_estadistica['situación']= np.select(condiciones, valores, default='Nini')

In [183]:
clase_estadistica

           Nombre Apellido  Edad  Edad_dias mayoria_edad    situación
Municipio
Mty         Jorge    Perez    21       7665        mayor  Universidad
Apodaca       Ana    Rosas    26       9490        mayor   Trabajando
Escobedo     Raúl    Gómez    22       8030        mayor  Universidad
Santiago   Andrea    Solis    19       6935        mayor  Universidad

In [184]:
clase_estadistica[['Edad','situación']]

           Edad    situación
Municipio
Mty          21  Universidad
Apodaca      26   Trabajando
Escobedo     22  Universidad
Santiago     19  Universidad

In [185]:
clase_estadistica['Edad'].mean()

22.0

In [188]:
clase_estadistica.groupby('situación')['Edad'].mean()

situación
Trabajando     26.000000
Universidad    20.666667
Name: Edad, dtype: float64

In [189]:
clase_estadistica.groupby('situación')['Edad'].mean().round(1)

situación
Trabajando     26.0
Universidad    20.7
Name: Edad, dtype: float64

In [190]:
clase_estadistica.groupby('situación')['Edad'].agg('mean')

situación
Trabajando     26.000000
Universidad    20.666667
Name: Edad, dtype: float64

In [193]:
clase_estadistica.groupby('situación')['Edad'].agg(['mean', 'count', 'std']).round(1)

             mean  count  std
situación
Trabajando   26.0      1  NaN
Universidad  20.7      3  1.5